from __future__ import print_function

import time

import openpyxl

start_time = time.time()

clientList = {
    # Заявки
    "А Эстейт": "А_ЭСТ", "Абсолют Строй Сервис": "АСС_", "Бекар": "БЕКАР", "Вита Ропшинский Квартал": "ВИТА",
    "ВТБ Арена Парк": "ВТБ", "ЖК Полет Тасп Технолоджи": "ТАСП", "Ленстройтрест": "ЛЕНСТР",
    "ЛСР Комфорт": "ЛСР_К", "ЛСР Премиум": "ЛСР_П", "Мастер на Серебристом": "МАСТЕР_Д", "Метрика": "МЕТРИКА",
    "ПАН": "ПАН_", "Патриот Нева": "ПАТРИОТ", "Петрострой": "ПЕТРОСТРОЙ",
    "Рождественно Мир Митино": "РОЖДЕСТВЕНО", "Росстрой Инвест": "РОССТР", "Тренд": "РАЙОНЫ",
    "Хочу Квартиру": "ХОЧУ", "Эталон Серебряный фонтан": "ЭТАЛОН_ИНВЕСТ_ФОНТАН", "Северный город": "СЕВЕРН",
    "ПСК": "ПСК",

    # Спецпроекты
    "Альянс Добрыня - 2": "АЛЬЯНС_ДОБРЫНЯ", "АСД Маленькая Швейцария": "ШВЕЙЦАРИЯ", "Афи Сильвер": "AFI",
    "Балтийская Жемчужина": "БАЛТИЙСКАЯ", "БФА Огни Залива": "БФА", "Вита Федоровское": "ВИТА_Ф",
    "Легенда": "LEGENDA", "ЛенСпецСму бизнес": "ЛЕНСПЕЦСМУ_БИЗНЕС", "ЛенСпецСму комфорт": "ЛЕНСПЕЦСМУ_КОМФОРТ",
    "ЛСР Лучи": "ЛСР_МОСКВА_ЛУЧИ", "Мавис": "МАВИС",
    "Мастер Недвижимость Елизаровский": "МАСТЕР_НЕДВИЖИМОСТЬ_ЕЛИЗАРОВСКИЙ",
    "Мастер Недвижимость Черная Речка": "МАСТЕР_НЕДВИЖИМОСТЬ_ЧЕРНАЯ", "МИЦ Бунино": "МИЦ_ЮЖНОЕ_БУНИНО",
    "Монолит Вингс": "МОНОЛИТ", "Ойкумена": "ОЙКУМЕНА",
    "Полис Групп Комендантский": "ПОЛИС_ГРУПП_КОМЕНДАНТСКИЙ", "Самолет": "САМОЛЕТ", "Севен Санс": "SEVEN_SUNS",
    "Технополис Премьера 2": "ТЕХНОПОЛИС_ПРЕМЬЕРА2", "ФСК Ай Проспект": "ФСК_АЙПРОСПЕКТ", "ЦДС": "ЦДС",
    "ЮИТ": "ЮИТ", "Технополис Рыбацкая Гавань": "ТЕХНОПОЛИС_РЫБАЦКАЯ",
    "Полис Групп Московский": "ПОЛИС_ГРУПП_МОСКОВСКИЙ", "ЛСР Зиларт": "ЛСР_МОСКВА_ЗИЛАРТ",
    "ЛСР Ленинградка": "ЛСР_МОСКВА_ЛЕНИНГРАДКА", "МИЦ ЭмДжиКом": "МИЦ_ЭМДЖИКОМ"
}


def importValues():
    wb = openpyxl.load_workbook('report.xlsx')
    ws = wb["Данные"]
    ws.insert_cols(1)
    ws["A1"] = "Клиент"
    # clientsCampaigns = {a: [] for a in clientList.keys()}
    for n in range(2, ws.max_row):
        for name in clientList.keys():
            if clientList.get(name) in ws["C"][n].value:
                _ = ws.cell(row=n + 1, column=1, value=name)
                print("Найден клиент %s для кампании %s" % (name, ws["C"][n].value))

    wb.save(filename="report.xlsx")


importValues()

print("\n--- %s seconds ---" % (time.time() - start_time))
