from __future__ import print_function

import time

import openpyxl

start_time = time.time()

clientList = {
    # Заявки
    "А 101": "А101",
    "А Эстейт": "А_ЭСТ",
    "Абсолют Строй Сервис": "АСС_",
    "Бекар": "БЕКАР",
    "Вита Ропшинский Квартал": "ВИТА",
    "Главстрой СПб": "ГЛАВСТРОЙ",
    "ВТБ Арена Парк": "ВТБ",
    "ЕОН": "ЕОН",
    "ЖК Полет Тасп Технолоджи": "ТАСП",
    "Ленстройтрест": "ЛЕНСТР",
    "ЛСР Комфорт": "ЛСР_К",
    "ЛСР Премиум": "ЛСР_П",
    "М16": "М16",
    "Мастер на Серебристом": "МАСТЕР_Д",
    "Метрика": "МЕТРИКА",
    "Мир Квартир": "МИР_КВАРТИР",
    "МР Групп": "MR_GROUP",
    "ПАН": "ПАН_",
    "Патриот Нева": "ПАТРИОТ",
    "Петрострой": "ПЕТРОСТРОЙ",
    "ПСК": "ПСК",
    "Реновация Новое Колпино": "РЕНОВАЦИЯ",
    "РБиАй": "RBI",
    "РГ Девелопмент": "РГ_ДЕВЕЛОПМЕНТ",
    "Рождественно Мир Митино": "РОЖДЕСТВЕНО",
    "Северный город": "СЕВЕРН",
    "РосСтройИнвест": "РОССТР",
    "Тренд Районы": "РАЙОНЫ",
    "ФСК MG.com": "ФСК_ЭМДЖИКОМ",
    "Хочу Квартиру 3000": "ХОЧУ",
    "Этажи": "ЭТАЖИ",
    "Эталон Серебряный фонтан": "ЭТАЛОН_ИНВЕСТ_ФОНТАН",

    # Спецпроекты
    "Альянс Добрыня": "АЛЬЯНС_ДОБРЫНЯ",
    # "АСД Маленькая Швейцария": "ШВЕЙЦАРИЯ",
    "Афи Сильвер": "AFI",
    "Балтийская Жемчужина": "БАЛТИЙСКАЯ",
    "БФА Огни Залива": "БФА",
    "Вита Федоровское": "ВИТА_Ф",
    # Глоракс Английская Миля
    # Глоракс Лиговский Сити
    "Комфорт Строй Барская Усадьба": "КОМФОРТСТРОЙ",
    "Легенда": "LEGENDA",
    "ЛенСпецСму бизнес": "ЛЕНСПЕЦСМУ_БИЗНЕС",
    "ЛенСпецСму комфорт": "ЛЕНСПЕЦСМУ_КОМФОРТ",
    "ЛСР Лучи": "ЛСР_МОСКВА_ЛУЧИ",
    "Мавис": "МАВИС",
    "Мастер Недвижимость Елизаровский": "МАСТЕР_НЕДВИЖИМОСТЬ_ЕЛИЗАРОВСКИЙ",
    "Мастер Недвижимость Черная Речка": "МАСТЕР_НЕДВИЖИМОСТЬ_ЧЕРНАЯ",
    "МИЦ Бунино": "МИЦ_ЮЖНОЕ_БУНИНО",
    "Монолит Вингс": "МОНОЛИТ",
    "Мир Квартир Монополист": "МОНОПОЛИСТ",
    "Нордэст Шуваловский": "НОРДЭСТ",
    "Ойкумена": "ОЙКУМЕНА",
    # "Отделстрой Оккервиль": "ОТДЕЛСТРОЙ_ОККЕР",
    # "Отделстрой Лесснер": "ОТДЕЛСТРОЙ_ЛЕСС",
    "Романтика ЖК Ромашки": "РОМАНТИКА",
    "Самолет": "САМОЛЕТ",
    "Севен Санс": "SEVEN_SUNS",
    "Спутник Тирамису": "ТИРАМИСУ",
    "ФСК Ай Проспект": "ФСК_АЙПРОСПЕКТ",
    "ЦДС": "ЦДС",
    "ЮИТ": "ЮИТ",
    "Технополис Премьера 2": "ТЕХНОПОЛИС_ПРЕМЬЕРА2",
    "Технополис Рыбацкая Гавань": "ТЕХНОПОЛИС_РЫБАЦКАЯ",
    "Полис на Комендантском": "ПОЛИС_ГРУПП_К",
    # "Полис Групп Московский": "ПОЛИС_ГРУПП_МОСКОВСКИЙ",
    "ЛСР Зиларт": "ЛСР_МОСКВА_ЗИЛАРТ",
    "ЛСР Ленинградка": "ЛСР_МОСКВА_ЛЕНИНГРАДКА",
    "МИЦ ЭмДжиКом": "МИЦ_ЭМДЖИКОМ",
    "Эталон Инвест Изумрудные Холмы": "ЭТАЛОН_ХОЛМЫ"
}


def importValues():
    wb = openpyxl.load_workbook('report.xlsx')
    ws = wb["Данные"]
    ws.insert_cols(1)
    ws["A1"] = "Клиент"
    # clientsCampaigns = {a: [] for a in clientList.keys()}
    for n in range(2, ws.max_row):
        print(ws["C"][n].value)
        for name in clientList.keys():
            if clientList.get(name) in str(ws["C"][n].value[11:-4]):
                _ = ws.cell(row=n + 1, column=1, value=name)
                print("Найден клиент %s для кампании %s" % (name, ws["C"][n].value))

    wb.save(filename="report.xlsx")


importValues()

print("\n--- %s seconds ---" % (time.time() - start_time))
